In [2]:
#import librarires
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os

In [4]:
kashti = sns.load_dataset("titanic")
ks1 = kashti
ks2 = kashti

In [7]:
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [9]:
(kashti['age']+1).head()

0    23.0
1    39.0
2    27.0
3    36.0
4    36.0
Name: age, dtype: float64

In [11]:
kashti.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [14]:
#Use dropna method
# print(kashti.shape)
kashti.dropna(subset=['deck'], axis=0, inplace=True)

In [16]:
kashti.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [18]:
kashti.dropna().isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [20]:
kashti

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [22]:
ks1.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [25]:
ks1.shape

(203, 15)

In [28]:
mean = ks1['age'].mean()
mean

35.77945652173913

In [30]:
ks1['age'] = ks1['age'].replace(np.nan, mean)

In [32]:
ks1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [35]:
ks1.head(20)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.000000,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.000000,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.000000,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
21,1,2,male,34.000000,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
23,1,1,male,28.000000,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
27,0,1,male,19.000000,3,2,263.0000,S,First,man,True,C,Southampton,no,False
31,1,1,female,35.779457,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
52,1,1,female,49.000000,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False
54,0,1,male,65.000000,0,1,61.9792,C,First,man,True,B,Cherbourg,no,False
55,1,1,male,35.779457,0,0,35.5000,S,First,man,True,C,Southampton,yes,True
61,1,1,female,38.000000,0,0,80.0000,NaN,First,woman,False,B,NaN,yes,True
62,0,1,male,45.000000,1,0,83.4750,S,First,man,True,C,Southampton,no,False
66,1,2,female,29.000000,0,0,10.5000,S,Second,woman,False,F,Southampton,yes,True
75,0,3,male,25.000000,0,0,7.6500,S,Third,man,True,F,Southampton,no,True
88,1,1,female,23.000000,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
92,0,1,male,46.000000,1,0,61.1750,S,First,man,True,E,Southampton,no,False
96,0,1,male,71.000000,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
97,1,1,male,23.000000,0,1,63.3583,C,First,man,True,D,Cherbourg,yes,False

In [37]:
kashti.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [42]:
kashti['survived'] = kashti['survived'].astype('int64')
kashti.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [44]:
ks1['age'] = ks1['age'] *365
ks1.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,5.062550e+06,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,4.662875e+06,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,7.194150e+06,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,5.329000e+05,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,7.727050e+06,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
21,1,2,male,4.529650e+06,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
23,1,1,male,3.730300e+06,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
27,0,1,male,2.531275e+06,3,2,263.0000,S,First,man,True,C,Southampton,no,False
31,1,1,female,4.766718e+06,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
52,1,1,female,6.528025e+06,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False

In [46]:
ks1.rename(columns={"age": "age in days"}, inplace=True)
ks1.head(10)

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,5.062550e+06,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,4.662875e+06,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,7.194150e+06,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,5.329000e+05,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,7.727050e+06,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
21,1,2,male,4.529650e+06,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
23,1,1,male,3.730300e+06,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
27,0,1,male,2.531275e+06,3,2,263.0000,S,First,man,True,C,Southampton,no,False
31,1,1,female,4.766718e+06,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
52,1,1,female,6.528025e+06,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False

In [48]:
kashti.head()

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,5062550.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,4662875.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,7194150.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,532900.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,7727050.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [51]:
ks4 = kashti[['age in days', 'fare']]
ks4.head(10)

     age in days      fare
1   5.062550e+06   71.2833
3   4.662875e+06   53.1000
6   7.194150e+06   51.8625
10  5.329000e+05   16.7000
11  7.727050e+06   26.5500
21  4.529650e+06   13.0000
23  3.730300e+06   35.5000
27  2.531275e+06  263.0000
31  4.766718e+06  146.5208
52  6.528025e+06   76.7292

In [53]:
ks4['fare']=ks4['fare']/ks4['fare'].max()
ks4.head()

C:\Users\ahmed\AppData\Local\Temp\ipykernel_6452\129955860.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks4['fare']=ks4['fare']/ks4['fare'].max()

    age in days      fare
1     5062550.0  0.139136
3     4662875.0  0.103644
6     7194150.0  0.101229
10     532900.0  0.032596
11    7727050.0  0.051822

In [56]:
ks = sns.load_dataset("titanic")
ks.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [57]:
bins = np.linspace(min(ks['age']), max(ks['age']), 15000)
age_group = ["Bachey", "Jawan", "Boorhay"]
ks['age'] = pd.cut(ks['age'], bins, labels=age_group, include_lowest=True)
kashti['age']

ValueError: Bin labels must be one fewer than the number of bin edges